C16/system/sampleDict2
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      sampleDict2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Computes the volume average differential pressure between the outdoor and
// indoor cellZones using pGaugePa.

type            fieldValueDelta;
libs            ("libfieldFunctionObjects.so");

log             true;
writeControl    writeTime;

// Reports volAverage(pGaugePa in domainOutside)
//       - volAverage(pGaugePa in domainInside).
operation       subtract;

region1
{
    type            volFieldValue;
    libs            ("libfieldFunctionObjects.so");

    writeFields     false;
    cellZone        domainOutside;
    operation       volAverage;
    fields          (pGaugePa);
}

region2
{
    type            volFieldValue;
    libs            ("libfieldFunctionObjects.so");

    writeFields     false;
    cellZone        domainInside;
    operation       volAverage;
    fields          (pGaugePa);
}

// ************************************************************************* //
